Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-54-56.tmx
Source language: bo
Languages: en

source: །འདི་ནི་བདག་གིས་དགེ་བཤེས་ཆོས་སྨྲ་བ།
en: ‘He is my kalyāṇamitra, my dharmabhāṇaka;

source: །ཆོས་ཀུན་ནན་ཏན་ཡོངས་སུ་སྟོན་བྱེད་པ།
en: He will teach me the practices of all the Dharma

source: །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ལམ་ཡོངས་སྟོན་པ།
en: And will teach me the path of bodhisattva conduct.’

source: །ཡིན་ཞེས་སེམས་གཅིག་བསམ་ནས་འདིར་འོངས་སོ།
en: “He has come here with this kind of virtuous motivation:

source: །བྱང་ཆུབ་སེམས་དཔའ་བདག་གིས་བློ་བསྐྱེད་པ།
en: ‘The bodhisattvas will develop my understanding.

source: །སངས་རྒྱས་སྲས་པོ་བྱང་ཆུབ་བསྐྱེད་བྱེད་པ།
en: The sons of the buddhas will make me give rise to enlightenment.

source: །འདི་དག་བདག་བཤེས་སངས་རྒྱས་བསྔགས་པ་ཞེས། །དེ་ལྟར་དགེ་བའི་སེམས་ཀྱིས་འདིར་འོངས་སོ།
en: The buddhas praise these kalyāṇamitras of mine.

source: །འདི་དག་བསྐྱེད་པས་བདག་གིས་མ་ལྟ་བུ།
en: ‘They give birth to these qualities and so are like my mother.

source: །ཡོན་ཏན་འོ་མ་ལྡུད་པས་མ་མ་འདྲ།
en: They give me the milk of qualities and so are like my wet nurse.

source: །བྱང་ཆུབ་ཡན་ལག་ཡོངས་སུ་སྐྱོང་བ་ཡིན།
en: They completely protect my aspects of enlightenment.

source: །དགེ་བཤེས་འདི་དག་གནོད་པ་རྣམ་པར་ཟློག །རྒ་ཤི་མཐར་བྱེད་སྨན་པ་ལྟ་བུ་སྟེ།
en: These kalyāṇamitras protect me from that which is harmful. “ ‘They free from aging and death, like physicians.

source: །བདུད་རྩིའི་ཆར་འབེབས་བརྒྱ་བྱིན་ལྷ་དབང་འདྲ།
en: They send down a rain of amrita like Śakra, lord of the devas.

source: །ཟླ་བ་ལྟ་བུ་དཀར་པོའི་ཕྱོགས་ཀྱིས་རྒྱས།
en: They increase that which is good, like the moon.

source: །ཞི་བའི་ཕྱོགས་སྟོན་ཉི་མ་གསལ་བ་འདྲ།
en: They reveal the path to peace, like the sun.

source: །དགྲ་དང་འགྲོགས་ལ་རི་བོ་འདྲ་བ་སྟེ།
en: ‘They are impartial to enemies and friends, like a mountain.

source: །རྒྱ་མཚོ་བཞིན་དུ་མི་འཁྲུག་སེམས་དང་ལྡན།
en: They have minds that cannot be shaken, like an ocean.

source: །ཡོངས་སུ་སྐྱོང་དང་མཉན་པ་འདྲ་བ་ཞེས།
en: And they keep me safe, like a sea captain!’

source: །དེ་འདྲའི་སེམས་ཀྱིས་ནོར་བཟངས་འདིར་འོངས་སོ།
en: Sudhana, who has such a mind, has come here.

source: །འཇིགས་མེད་སྐྱོབ་པས་དཔའ་བོ་ལྟ་བུ་སྟེ།
en: ‘They save me from dangers, like heroes.

source: །དེད་དཔོན་མགོན་དང་སྐྱབས་སུ་གྱུར་པ་ཡིན།
en: They are protectors and refuges, like caravan leaders.

source: །འདི་དག་བདག་ལ་བདེ་སྟོབས་དམྱིགས་ཡིན་ཞེས།
en: They are focused on providing me with happiness!’

source: །དེ་འདྲའི་སེམས་ཀྱིས་དགེ་བཤེས་བསྙེན་བཀུར་བྱེད།
en: With such an outlook, he honors the kalyāṇamitras.

source: །ཆོས་ཀྱི་ཕྱོགས་རྣམས་རྟག་ཏུ་སྟོན་པ་སྟེ།
en: ‘They always teach me all the aspects of the Dharma.

source: །སངས་རྒྱས་ཡོན་ཏན་ཡེ་ཤེས་སྟོན་པ་ཡིན།
en: They teach me the qualities and wisdom of all buddhas.

source: །ངན་སོང་ངན་འགྲོ་ཐམས་ཅད་སྦྱོང་བར་བྱེད།
en: They purify all lower realms, all lower existences.

source: དགེ་བཤེས་འདི་དག་བདག་ལ་དགེ་བ་སྟོན།
en: These kalyāṇamitras teach goodness to me.

source: །འདི་དག་རྒྱལ་བའི་མཛོད་ཀུན་སྟོབས་པ་ཡིན།
en: ‘They bestow all the treasures of the jinas.

source: །འདི་དག་རྒྱལ་བ་ཀུན་གྱི་མཛོད་སྲུང་སྟེ།
en: They guard all the treasures of the jinas.

source: །འདི་དག་རྒྱལ་བ་ཀུན་གྱི་གསང་འཛིན་ཅེས།
en: They possess the secrets of all the jinas.’

source: །དེ་ལྟར་མཁས་པ་འདི་ནི་དགེ་བཤེས་བསྙེན།
en: In that way, this wise one venerates the kalyāṇamitras. “ ‘Through them perfect wisdom is purified.

source: །ཡེ་ཤེས་ཕུན་ལྡན་འདི་ལས་རྣམ་པར་དག །གཟུགས་དང་ལོངས་སྤྱོད་ཆོ་རིགས་ཕུན་སུམ་ཚོགས།
en: A perfect body, possessions, family, and birth—

source: །འདི་ལས་ཕུན་སུམ་ཚོགས་ཀུན་དཀོན་པ་མིན།
en: All perfections are easily obtained from them.’

source: །བསམ་པ་དེ་འདྲས་འདི་ནི་འདིར་འོངས་སོ།
en: Thinking in that way, he has come here.

source: །བསམ་པ་རླབས་ཆེན་འདི་ལ་ཀུན་ཀྱང་ལྟོས།
en: “You should all regard his vast motivation,

source: །མཁས་པའི་དགེ་བཤེས་རྣམས་ལ་འདི་སྟེན་ཅིང་།
en: This wise one who relies on the kalyāṇamitras.

source: །མཁས་པ་འདི་བློ་ཅི་འདྲ་སྐྱེད་པ་ལྟོས།
en: Observe the understanding this wise one has developed.

source: །ཁྱོད་ཀྱིས་རྟག་ཏུ་དེ་ལྟར་བསླབ་པར་བྱ།
en: This is how all of you should always train.

source: །འདི་ནི་སྔོན་གྱི་བསོད་ནམས་དགེ་བའི་རྒྱུས།
en: “Through his previous good actions and merit as a cause,

source: །བྱང་ཆུབ་ཞུགས་ཏེ་འཇམ་དཔལ་མཐོང་གྱུར་ནས།
en: He has seen Mañjuśrī and is established in enlightenment.

source: །དེ་ཡི་གདམས་ངག་རྗེས་སུ་མཐུན་སྤྱོད་ཅིང་།
en: He has practiced in accordance with his instructions.

source: །སྐྱོ་བ་མེད་པར་རྒྱུ་བ་འདི་ལ་ལྟོས།
en: Observe how this one has traveled without wearying.

source: །འདི་ནི་དགའ་བདེ་ཐམས་ཅད་ཀུན་སྤངས་ཏེ།
en: “He has renounced all pleasures and happiness.

source: །ལྷ་རྫས་ལྟ་བུའི་ཁྱིམ་ཡང་ཡོངས་སུ་སྤངས།
en: He has renounced his home that seemed to be divine.

source: །ཕ་མ་མ་མ་སྐྱིད་པ་རྒྱ་ཆེན་ཀུན།
en: He has renounced his parents, his nanny, and vast enjoyments,

source: །ཡོངས་སུ་སྤངས་ཤིང་བྲན་ལྟར་བཤེས་གཉེན་སྟེན།
en: And like a slave he has served the kalyāṇamitras.

source: །མཁས་པ་འདིས་ནི་བསམ་པ་རྣམ་སྦྱངས་ཏེ།
en: “This wise one, having purified his motivation,

source: །བདག་གིས་མ་ལུས་ཡོངས་སུ་སྤངས་བྱས་ནས།
en: Has renounced all that he possessed, without exception.

source: །སངས་རྒྱས་ཀུན་གྱི་ཕོ་བྲང་འགྲོ་བར་འགྱུར།
en: He will go to the palaces of all the buddhas

source: །དེ་ཕྱིར་འབྲས་བུ་དེ་འདྲའང་ཐོབ་པར་གྱུར།
en: And therefore will attain this kind of result. “With a motivation of compassion, he acts to benefit beings,

source: །འདིས་ནི་རྒ་དང་ནད་ཀྱིས་མནར་བ་ཡི།
en: Having seen them tormented by aging and illness

source: །སྲོག་ཆགས་སྡུག་བསྔལ་བརྒྱ་ཡིས་གཙེས་པ་རྣམས།
en: And afflicted with hundreds of sufferings

source: །སྐྱེ་ཤི་མྱ་ངན་འཇིགས་པས་གདུང་མཐོང་ནས། །དེ་དག་དོན་དུ་སྙིང་རྗེའི་སེམས་ཀྱིས་སྤྱོད།
en: And oppressed by birth and death, misery and fear. “Having seen beings crushed by the machinery of suffering

source: །འགྲོ་རྒྱུད་ལྔ་ཡི་འཁོར་ལོའི་དཀྱིལ་འཁོར་དུ།
en: In the domain of the circle of the five classes of beings,

source: །སྡུག་བསྔལ་འཁྲུལ་འཁོར་བཙིར་བའི་འགྲོ་མཐོང་ནས།
en: He sees this strong thunderbolt of wisdom

source: །སྡུག་བསྔལ་འཁྲུལ་འཁོར་འཁོར་ལོ་འཇོམས་པ་ཡི།
en: That destroys the wheel of the machinery of suffering.

source: །ཡེ་ཤེས་རྡོ་རྗེ་སྲ་བ་འདི་ཚོལ་ལོ།
en: “He seeks the excellent plow of wisdom In order to purify the fields of beings

source: །འདོད་ཆགས་ཞེ་སྡང་རྩྭ་སྡོང་ཚེར་མ་ཅན།
en: With their grass, trees, and thorns of desire

source: །ལྟ་ཆགས་རྩ་མང་ཡོངས་སུ་འཛིངས་པ་ཡི།
en: And their numerous tangled growths of attachment to views.

source: །སེམས་ཅན་ཞིང་ནི་ཡོངས་སུ་སྦྱང་བའི་ཕྱིར།
en: “He will become an excellent caravan leader for beings,

source: །ཤེས་རབ་གཞོལ་བརྟན་བཟང་པོ་འདི་ཚོལ་ལོ།
en: With the power to show the happy direction to travel

source: །གཏི་མུག་མ་རིག་ཐིབས་པོའི་བསམ་པ་ཅན། །འགྲོ་བ་ཤེས་རབ་མིག་སྟོར་དམྱིགས་མེད་པ།
en: To beings who are blind, having lost their eyes of wisdom, And whose thoughts are a wilderness of ignorance and stupidity.

source: །དེ་ལ་ཕྱོགས་བདེ་སྟོན་པའི་མཐུ་ཡོད་པའི། །འགྲོ་བའི་དེད་དཔོན་བཟང་པོར་འདི་འགྱུར་རོ།
en: “This hero with the strength of fearlessness,

source: །བཟོད་པའི་གོ་བགོས་རྣམ་ཐར་བཞོན་པ་ཞོན།
en: Who wears the armor of patience, rides the steed of liberation,

source: །ཡེ་ཤེས་རལ་གྲིས་མྱ་ངན་དགྲ་འཇོམས་པས། །མི་འཇིགས་སྟོབས་པའི་དཔའ་བོར་གྱུར་པ་འདི།
en: And with the sword of wisdom defeats the enemy who is misery,

source: །འགྲོ་བ་རྣམས་ཀྱི་ལམ་སྟོན་འགྱུར་བ་ཡིན།
en: Will become a teacher of the path for beings. “He will be a sea captain for the ocean of the three realms

source: །འདི་ནི་ཆོས་ཀྱི་གྲུ་རབ་སྦྱོར་བ་སྟེ།
en: Who has mastered sailing the ship of the Dharma,

source: །ཡེ་ཤེས་རྒྱ་མཚོའི་ལམ་ལ་བསླབས་པའོ།
en: Has learned the routes in the ocean of wisdom,

source: །ཞི་བ་རིན་ཆེན་མཆོག་གིས་གླིང་སྐྱེལ་བ།
en: And will take beings to the island of the supreme jewels of peace.

source: །འདི་ནི་ཁམས་གསུམ་མཚོ་ཡི་སྐྱེ་བ་འཛིན།
en: “He will ascend as a sun that is a buddha With bright light in the sky of the realm of phenomena,

source: །ཡེ་ཤེས་འོད་ཟེར་སྨོན་ལམ་དཀྱིལ་འཁོར་ཅན།
en: As a disk of prayer with the light rays of wisdom

source: །སེམས་ཅན་ཀུན་གྱི་གནས་སུ་སྣང་བྱེད་པའི། །ཆོས་དབྱིངས་མཁའ་ལ་འོད་ཆེན་རབ་ལྡན་པར།
en: Illuminating the abodes of all beings.

source: །འདི་ནི་སངས་རྒྱས་ཉི་མར་འཆར་བར་འགྱུར།
en: “He will arise as a moon that is a buddha,

source: །བྱམས་པའི་དགའ་ལྡན་ཏིང་འཛིན་དང་བསིལ་བའི།
en: As a full moon disk of white qualities

source: །སེམས་ཅན་ཀུན་ལ་སྙོམས་སེམས་འོད་བཟང་ལ། །དཀར་པོའི་ཆོས་ཀྱིས་དཀྱིལ་འཁོར་ཡོངས་རྒྱས་པའི།
en: With a light that accords with the wishes of all beings

source: །སངས་རྒྱས་ཟླ་བ་འདི་ནི་འཆར་བར་འགྱུར།
en: And is the cooling samādhi of the joy of love.

source: །བསམ་པའི་གཞི་རྟེན་བརྟན་ལ་རབ་གནས་པ།
en: “Residing on a solid ground of aspiration,

source: །བྱང་ཆུབ་སྤྱོད་པས་རིམ་གྱིས་འཕགས་པ་སྟེ། །ཆོས་ཀུན་རིན་ཆེན་འབྱུང་གནས་ལྡན་པ་ཡི།
en: Ascending though the stages of bodhisattva conduct,

source: །ཡེ་ཤེས་རྒྱ་མཚོའི་མཆོག་ཏུ་འདི་འགྱུར་རོ།
en: He will become a supreme ocean of wisdom That is the source of all the jewels of the Dharma.

source: །བྱང་ཆུབ་སེམས་ཀྱི་ཀླུ་ཡི་དབང་གིས་ཕྱུང་།
en: “He will be lord of the nāgas of aspiration to enlightenment,

source: །ཆོས་ཀྱི་དབྱིངས་ཀྱི་མཁའ་ལ་མངོན་པར་འཕགས།
en: And he will ascend into the sky of the realm of phenomena And will send down rain from Dharma clouds onto beings

source: །དཀར་པོའི་འབྲས་བུའི་ལོ་ཏོག་འཕེལ་བྱེད་པའི།
en: And increase the harvests that are excellent results.

source: །འདི་ནི་འགྲོ་བར་ཆོས་སྤྲིན་ཆར་འབེབས་འགྱུར།
en: “He will shine as the lamp of the Dharma,

source: །དག་པའི་སྙིང་པོའི་དྲི་གསུམ་མུན་སེལ་བ།
en: Which has the excellent flame of the stainless aspiration for enlightenment,

source: །བྱམས་པའི་སྣུམ་ཡོད་དྲན་པའི་སྣོད་བརྟན་ལ།
en: And which has the oil of love in the enduring bowl of memory

source: །དྲི་མེད་བྱང་ཆུབ་སེམས་མེ་འོད་བཟང་པོའི།
en: And a pure essence that eliminates the darkness of the three stains.

source: །ཆོས་ཀྱི་མར་མེ་འདི་ནི་འབར་བྱེད་འགྱུར།
en: “The first-week embryo is the aspiration to enlightenment,

source: །བྱང་ཆུབ་སེམས་ནི་མར་མེར་སྙིང་རྗེ་སྐོ།
en: The second-week embryo is compassion, the third-week embryo is love,

source: །བྱམས་པ་རྡོལ་པ་མི་གཡོ་བསམ་པ་འཁྲེགས།
en: The fourth-week embryo is unwavering aspiration, and finally

source: །བྱང་ཆུབ་ཡན་ལག་མཐར་གྱིས་བྱུང་བ་ཡི། །སངས་རྒྱས་སྲས་སུ་འདི་ནི་ཡང་དག་སྐྱེ།
en: The limbs of enlightenment appear, and this son of the Buddha is born.

source: །བསོད་ནམས་སྙིང་པོ་མངོན་པར་འཕེལ་བར་བྱེད།
en: “He will increase the essence of merit.

source: །ཡེ་ཤེས་སྙིང་པོ་ཡོངས་སུ་སྤྱོད་པར་འགྱུར།
en: He will purify the essence of wisdom.

source: །འདི་ནི་ཤེས་པའི་སྙིང་པོ་འཆར་བར་བྱེད།
en: He will arise in the essence of wisdom

source: །སྨོན་ལམ་ཅི་བཞིན་སྙིང་པོ་ཡང་དག་བྱུང་།
en: And will come to be just as in the essence of prayer.

source: །སྙིང་རྗེ་བྱམས་པས་སྤྲུལ་པ་འདི་འདྲ་བ།
en: “This kind of emanation from love and compassion

source: །སེམས་ཅན་དགྲོལ་བློ་ཕན་པའི་བསམ་ལྡན་པ།
en: Intending to liberate beings and motivated to benefit others,

source: །རྣམ་དག་ཡིད་ཅན་འདི་ནི་ཅི་འདྲ་བ།
en: Someone who has this kind of a pure mind—

source: །དེ་འདྲའི་འགྲོ་བ་ལྷ་དང་མིར་བཅས་དཀོན།
en: That kind of being is rare among devas and humans.

source: །འདི་འདྲའི་བསམ་པ་རབ་ཏུ་རྩ་བརྟན་ལ།
en: “Someone who has such a stable root of aspiration,

source: །འདི་འདྲའི་སྦྱོར་བ་བརྟན་པས་རྣམ་འཕེལ་ཅིང་།
en: Who has such an increasing stable engagement,

source: །སྲིད་གསུམ་ཡོག་པར་བྱེད་པ་འདི་འདྲ་བའི།
en: Who is such a servant for the three existences—

source: །ཡེ་ཤེས་ཤིང་ཆེན་འབྲས་བུ་འབྱུང་བ་དཀོན།
en: Rare is such a tree of wisdom that yields fruit.

source: །འདི་ནི་ཡོན་ཏན་ཀུན་སྒྲུབ་དོན་དུ་གཉེར།
en: “He is dedicated to the arising of all qualities,

source: །ཆོས་རྣམས་ཐམས་ཅད་ཡོངས་སུ་དྲི་བར་མོས།
en: He aspires to inquire about all Dharmas,

source: །ཐེ་ཚོམ་ཐམས་ཅད་རྣམ་པར་གསལ་དོན་དུ།
en: And in order to dispel all doubts, he depends,

source: །ལེ་ལོ་མེད་པར་བཤེས་གཉེན་ཐམས་ཅད་སྟེན།
en: Without laziness, on all kalyāṇamitras.

source: །འདི་ནི་བདུད་ཀྱི་དཀྲུགས་མ་ཉོན་མོངས་འཇོམས།
en: “He defeats the kleśas and disturbances of the māras.

source: །འདི་ནི་ལྟ་བའི་དྲི་མ་སྲེད་པ་སེལ།
en: He dispels the craving and stains of wrong views.

source: །འདི་ནི་འགྲོ་བ་ཐམས་ཅད་དགྲོལ་ལ་བརྩོན།
en: He is dedicated to liberating all beings.

source: །མཁས་པ་འདི་ནི་རྟག་ཏུ་ཁྱད་པར་ཚོལ།
en: This wise one is always on a special quest.

source: །ཡོན་ཏན་ལམ་ལ་མ་ནོར་འདི་གནས་པས།
en: “Through being correctly established on the path to qualities,

source: །འདི་ནི་ངན་སོང་ཐམས་ཅད་སྦྱོང་བར་འགྱུར།
en: He will purify the lower existences.

source: །མཐོ་རིས་ལམ་ཡང་ཉེ་བར་སྟོན་པར་འགྱུར།
en: He will reveal the path to the higher existences.

source: །ཐར་པའི་ལམ་དུ་འགྲོ་བ་འཛུད་པར་འགྱུར།
en: He will bring beings onto the path to liberation.

source: །འདི་ནི་འགྲོ་རྒྱུད་ཀུན་གྱི་སྡུག་བསྔལ་སེལ།
en: “He will eliminate the sufferings of all classes of beings.

source: །འདི་ནི་འགྲོ་རྒྱུད་ཀུན་གྱི་བདེ་བ་སྟོབས།
en: He will bring happiness to all classes of beings.

source: །འདི་ནི་སྲིད་པ་ཀུན་གྱི་ཞགས་པ་འཐུབ།
en: He will cut through the noose of all existences,

source: །སྲིད་པའི་འགྲོ་རྒྱུད་ཐམས་ཅད་སེལ་བར་འགྱུར།
en: And he will become the eliminator of all the classes of existences.

source: །ལྟ་བ་དོགས་པ་རྣམ་པར་འབྱེད་པར་འགྱུར།
en: “He will open up the views that are narrow.

source: །སྲིད་པའི་འཁྲི་ཤིང་དྲ་བ་གཅོད་པར་འགྱུར།
en: He will cut through the nets of vines of craving.

source: །ཆགས་པའི་འདོད་ཆགས་ཉེ་བར་སྦྱོང་བར་འགྱུར།
en: He will purify the desire of attachment,

source: །སྲིད་གསུམ་ལམ་ཡང་ཡོངས་སུ་སྟོན་པར་འགྱུར།
en: And he will reveal the paths of the three existences.

source: །འདི་ནི་འཇིག་རྟེན་མགོན་དང་སྐྱབས་ཡིན་ཏེ།
en: “He will be a protector and refuge for the world.

source: །འདི་ནི་འགྲོ་བ་ཀུན་ལ་འོད་བྱེད་པའོ།
en: He will be a bringer of light for all beings.

source: །རྣམ་པ་ཀུན་ཏུ་སྲིད་པ་སེལ་ལ་མཁས།
en: He will be skilled in eliminating existences everywhere.

source: །ས་གསུམ་ཀུན་གྱི་འདྲེན་པར་འདི་འགྱུར་རོ།
en: He will become a guide for all three realms.

source: །ཉོན་མོངས་གཉིད་ལོག་འགྲོ་བ་སད་པར་བྱེད།
en: “He will wake beings from their sleep of the kleśas.

source: །འདོད་པའི་འདམ་ལས་མཁས་པ་འདི་སྒྲོལ་ཏེ།
en: This wise one will free them from the swamp of desire.

source: །འདུ་ཤེས་ཆགས་ལས་ཡོངས་སུ་འདི་ཡང་འགྲེལ།
en: He will liberate them from fixation on conceptualization,

source: །བཅིངས་པ་ཀུན་ལས་ཐར་བར་བྱེད་པར་འགྱུར།
en: And he will bring freedom from all bondage. “Sudhana, you will give rise to joy.

source: །ཆོས་དབྱིངས་གཞི་ཡི་བྱེ་བྲག་སྣང་བར་བྱེད།
en: You will illuminate the separate surfaces of the realm of phenomena.

source: །འཇིག་རྟེན་ཁམས་ཀྱི་བྱེ་བྲག་སྦྱོང་བར་འགྱུར།
en: You will purify the separate surfaces of the world realms.

source: །ཆོས་ཀུན་གཞི་ཡི་བྱེ་བྲག་ཕ་རོལ་ཕྱིན།
en: You will cross over all the separate bases of the realm of phenomena.

source: །ནོར་བཟངས་ཁྱོད་ནི་དགའ་བ་སྐྱེད་པར་འགྱུར།
en: “The way that you, the wise one, will practice,

source: །མཁས་པ་ཁྱོད་ཀྱི་སྦྱོར་བའི་ཚུལ་དག་དང་། །དག་ཅིང་ཁྱོད་ལ་སྨད་པ་མེད་ཚུལ་དང་། །ཁྱོད་ཀྱི་བསམ་པའི་ཡོན་ཏན་ལྡན་ཚུལ་ལས།
en: The way in which your faith is not inferior, The way your aspiration is endowed with good qualities

source: །བསམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་འགྱུར།
en: Will completely fulfill all aspirations.

source: །ཁྱོད་ཀྱི་བདག་ཉིད་དགེ་བར་བྱས་ཚུལ་གྱིས།
en: “Because of the way you have made yourself excellent,

source: །རིང་པོར་མི་ཐོགས་སངས་རྒྱས་ཀུན་མཐོང་འགྱུར།
en: Before long you will see all the buddhas,

source: །རིང་པོར་མི་ཐོགས་ཞིང་རྣམས་ཀུན་འགྲོར་འགྱུར།
en: Before long you will go to all the realms,

source: །ཆོས་ཀུན་རིང་པོར་མི་ཐོགས་ཤེས་པར་འགྱུར།
en: And before long you will know all Dharmas.

source: །ཞིང་རྣམས་རྒྱ་མཚོ་རྣམ་པར་སྦྱོང་བར་འགྱུར།
en: “You will purify an ocean of realms.

source: །སེམས་ཅན་རྒྱ་མཚོ་རྣམ་པར་འགྲེལ་བར་འགྱུར།
en: You will liberate an ocean of beings.

source: །སྤྱོད་པ་རྒྱ་མཚོ་ཡོངས་སུ་རྫོགས་པར་འགྱུར།
en: You will perfect an ocean of conduct.

source: །ཁྱོད་ཀྱི་ཡོན་ཏན་རྒྱ་མཚོ་དེ་འདྲའོ། །ཁྱོད་ཀྱི་མོས་པའི་དཀྱིལ་འཁོར་ཚུལ་ལས་ན།
en: You will have such an ocean of good qualities.

source: །ཁྱོད་ནི་ཡོན་ཏན་རྣམས་ཀྱི་སྣོད་དུ་འགྱུར།
en: “You will be a vessel for good qualities.

source: །ཁྱོད་ནི་དགེ་བ་ཡང་དག་འབྱུང་གནས་འགྱུར།
en: You will be a source of goodness.

source: །ཁྱོད་ནི་རྒྱལ་བའི་སྲས་དང་མཉམ་པར་འགྱུར།
en: You will be the same as a son of the jinas.

source: །ཁྱོད་ཀྱི་སྨོན་ལམ་དཀྱིལ་འཁོར་ཚུལ་ལས་ན།
en: Such is your field of aspiration.

source: །ཁྱོད་ཀྱིས་བདུད་ཀྱི་དཀྱིལ་འཁོར་ཕམ་པར་བྱས།
en: “You will defeat the field of the māras.

source: །ཁྱོད་ཀྱིས་ལས་ཀྱི་དཀྱིལ་འཁོར་རྣམ་པར་སྦྱངས།
en: You will purify the field of karma.

source: །ཉོན་མོངས་དཀྱིལ་འཁོར་ཁྱོད་ཀྱིས་དག་པར་བྱས།
en: You will purify the field of the kleśas. Such is your field of prayer.

source: །ཡེ་ཤེས་རྒྱུད་ནི་རྣམ་པར་སྦྱོང་བར་འགྱུར།
en: “You will purify the revolving of wisdom.

source: །ཆོས་ཀྱི་རྒྱུད་ནི་རབ་ཏུ་བརྗོད་པར་འགྱུར།
en: You will teach the revolving of Dharma. You will soon eliminate the revolving

source: །ལས་དང་ཉོན་མོངས་སྡུག་བསྔལ་འཁྲུལ་འཁོར་རྒྱུད།
en: Of the machinery of karma, kleśas, and suffering.

source: །རིང་པོར་མི་ཐོགས་རྣམ་པར་ཟློག་པར་འགྱུར།
en: “You will turn the supreme wheel of the Dharma, Which destroys the wheel of the suffering of all beings,

source: །འཇིག་རྟེན་འཁོར་ལོ་སྲིད་པའི་འཁོར་ལོ་རྟེན།
en: Dependence on the wheels of existence, the wheels of worlds,

source: །ཤུ་བའི་ལམ་རྒྱུད་ལྔ་ཡི་འཁོར་ལོར་རྨོངས། །འགྲོ་ཀུན་སྡུག་བསྔལ་འཁོར་ལོ་གཅོད་པ་ཡི། །ཆོས་ཀྱི་འཁོར་ལོ་དམ་པ་བསྐོར་བར་འགྱུར།
en: And the ignorance of the wheels of the blisters of the five existences.

source: །སངས་རྒྱས་རིགས་ནི་རྗེས་སུ་འཛིན་པར་འགྱུར།
en: “You will be a holder of the family of the Buddha.

source: །ཆོས་ཀྱི་རིགས་ནི་ཡོངས་སུ་སྦྱོང་བར་འགྱུར།
en: You will purify the family of the Dharma.

source: །དགེ་འདུན་རིགས་ནི་ཡོངས་སུ་བསྡུད་པར་འགྱུར།
en: You will gather the family of the Saṅgha.

source: །རིན་ཆེན་འབྱུང་བའི་འབྱུང་གནས་ཁྱོད་འགྱུར་རོ།
en: You will become a source from which the Jewels arise.

source: །སྲེད་པའི་དྲ་བ་རྣམ་པར་ཟློག་པར་འགྱུར།
en: “You will repel the net of craving

source: །ལྟ་བའི་དྲ་བ་ཐིབས་པོ་དེ་བཞིན་ཏེ།
en: And also the cluster of nets of wrong views,

source: །འགྲོ་བའི་སྡུག་བསྔལ་དྲ་བ་འགྲེལ་པར་འགྱུར།
en: And you will liberate beings from the net of suffering.

source: །སྨོན་ལམ་དྲ་བ་དེ་འདྲ་ཁྱོད་ཀྱིས་སྦྱངས།
en: Such is the net of your prayers.

source: །སེམས་ཅན་ཁམས་ནི་ཡོངས་སུ་སྨིན་བྱེད་འགྱུར།
en: “You will ripen the realm of beings.

source: །འཇིག་རྟེན་ཁམས་ནི་ཡོངས་སུ་སྦྱོང་བར་འགྱུར།
en: You will purify the world realms.

source: །ཡེ་ཤེས་ཁམས་ནི་ཤིན་ཏུ་དག་བྱེད་འགྱུར།
en: You will purify the realm of wisdom.

source: །ཁྱོད་ཀྱི་བསམ་པའི་ཁམས་ནི་དེ་འདྲའོ།
en: Such is the realm of your aspiration.

source: །ནོར་བཟངས་དགའ་བ་འཕེལ་བར་བྱེད་པ་ཁྱོད། །སེམས་ཅན་ཀུན་ལ་ཕན་བདེ་དགའ་བྱེད་འགྱུར།
en: “You will bring the happiness of the joy of benefit to beings.

source: །བྱང་ཆུབ་སེམས་དཔའ་རིགས་རྒྱུད་དགའ་བྱེད་ཅིང་།
en: You will bring the happiness of the family and lineage of the bodhisattvas.

source: །སངས་རྒྱས་ཐམས་ཅད་སྨོན་ལམ་དགའ་བྱེད་འགྱུར།
en: You will bring the happiness of the prayers of all the buddhas. Sudhana, you will become one who increases happiness.

source: །སེམས་ཅན་ཀུན་གྱི་འགྲོ་བའི་གནས་སྟོན་པ།
en: “You will reveal the abodes of the existences of all beings.

source: །ཞིང་རྣམས་ཐམས་ཅད་གཟུགས་བརྙན་སྣང་སྟོན་པ།
en: You will reveal the images of all the realms.

source: །ཆོས་རྣམས་ཐམས་ཅད་སྣང་བ་རབ་སྟོན་པའི།
en: You will reveal the illumination of all the Dharmas.

source: །ལྟ་ན་བཟང་བའི་རྒྱལ་བར་ཁྱོད་འགྱུར་རོ།
en: You will become a jina who is delightful to see.

source: །ཆོས་དབྱིངས་སྣང་བར་བྱེད་པའི་འོད་ལྡན་པ།
en: “You will have light that illuminates the realm of phenomena.

source: །སེམས་ཅན་ཁམས་རྣམས་བདེ་བྱེད་འོད་ལྡན་པ།
en: You will have light that brings happiness to the realms of beings.

source: །ངན་སོང་ཐམས་ཅད་ཞི་བྱེད་འོད་ལྡན་པའི།
en: You will have light that brings peace to the lower existences.

source: །སྲིད་གསུམ་སྡུག་བསྔལ་ཞི་བར་བྱེད་པར་འགྱུར།
en: You will become a pacifier of the sufferings in the three existences.

source: །མཐོ་རིས་ལམ་ནི་ཉེ་བར་སྟོན་པར་འགྱུར།
en: “You will reveal the door to the higher existences.

source: །སངས་རྒྱས་ལམ་ནི་འགྲོ་ལ་འབྱེད་པར་འགྱུར།
en: You will open the door to the buddhas for beings.

source: །ཐར་བའི་ལམ་དུ་འགྲོ་བ་ཁྲིད་པར་འགྱུར།
en: You will lead beings to the door to liberation.

source: །དེ་འདྲའི་ལམ་ནི་ཁྱོད་ཀྱིས་རྣམ་པར་སྦྱངས།
en: Such doors as these will be purified by you.

source: །ལོག་པའི་ལམ་ནི་རྣམ་པར་ཟློག་པར་འགྱུར།
en: “You will turn others away from the incorrect paths.

source: །སྐྱེ་བོ་འཕགས་པའི་ལམ་ལ་འདུལ་བར་འགྱུར།
en: You will guide them on the path of the higher beings.

source: །བརྟན་པའི་བློ་གྲོས་ལེ་ལོ་མེད་པ་ཁྱོད།
en: You who have strong understanding and no laziness

source: །མྱིག་ཡེང་བྱང་ཆུབ་ལམ་ནི་དེ་ལྟར་ཚོལ།
en: Will without distraction seek the path to enlightenment. “You will be dedicated to bringing to freedom from suffering

source: །སྲིད་པའི་རྒྱ་མཚོར་གནས་པའི་ལུས་ཅན་རྣམས། །སྡུག་བསྔལ་མཐར་འབྱིན་བྱ་བ་ཁྱོད་བརྩོན་པས།
en: The beings who dwell in the ocean of existence,

source: །འགྲོ་བ་སྲིད་པའི་མཚོ་ལས་སྒྲོལ་བར་འགྱུར།
en: And you will liberate beings from the ocean of existence.

source: །ཁྱོད་ཀྱི་ཡོན་ཏན་མཚོ་ཆེན་དེ་འདྲའོ།
en: Such are the great qualities you have.

source: །ཡེ་ཤེས་ཉི་མ་མཆོག་གི་འོད་གཟེར་མཚོས།
en: “With an ocean of the light rays from the supreme sun of wisdom,

source: །ལུས་ཅན་ཉོན་མོངས་རྒྱ་མཚོ་ཡོངས་སྐམས་ཤིང་།
en: You will dry up the ocean of the kleśas of beings.

source: །དེ་དག་ནན་ཏན་མཚོ་ལ་དགོད་བྱས་ནས།
en: You will establish them in an ocean of practice

source: །ཡེ་ཤེས་རྒྱ་མཚོ་རབ་ཏུ་དགོད་པར་འགྱུར།
en: And then establish them in an ocean of wisdom.

source: །བློ་གྲོས་རྒྱ་མཚོ་རྣམ་པར་འཕེལ་བར་འགྱུར།
en: “You will increase an ocean of understanding.

source: །སྤྱོད་པ་རྒྱ་མཚོ་རྣམ་པར་སྦྱང་བར་འགྱུར།
en: You will carry out an ocean of conduct. And before long you will enter into

source: །སངས་རྒྱས་ཀུན་གྱི་སྨོན་ལམ་རྒྱ་མཚོ་ལ། །རིང་པོར་མི་ཐོགས་ཡོངས་སུ་འཇུག་པར་འགྱུར།
en: An ocean of the prayers of all the buddhas.

source: །མཁས་པ་ཁྱོད་ནི་བློ་གྲོས་རྒྱ་མཚོའི་མཐུས།
en: “You, wise one, with the power of an ocean of understanding,

source: །ཞིང་རྣམས་རྒྱ་མཚོ་མང་པོར་ཕྱིན་པར་འགྱུར།
en: Will go to many oceans of realms,

source: །འཁོར་རྣམས་རྒྱ་མཚོ་མང་པོ་མཐོང་བར་འགྱུར།
en: You will see many oceans of assemblies,

source: །ཚེས་མང་རྒྱ་མཚོ་ཡོངས་སུ་འཐུང་བར་འགྱུར།
en: And you will drink oceans of many Dharmas.

source: །སངས་རྒྱས་སྤྲིན་མང་ཁྲག་ཁྲིག་མཐོང་བར་འགྱུར།
en: “You will see billions of clouds of buddhas.

source: །མཆོད་སྤྲིན་ཤིན་ཏུ་རྒྱ་ཆེན་བྱེད་པར་འགྱུར།
en: You will perform vast clouds of offerings.

source: །ཆོས་ཀྱི་སྤྲིན་མང་ཁྲག་ཁྲིག་ཐོས་པར་འགྱུར།
en: You will hear billions of clouds of Dharma.

source: །ཁྱོད་ནི་སྨོན་ལམ་དེ་འདྲའི་སྤྲིན་ཀྱང་བྱེད།
en: You will create such clouds of prayers as these.

source: །སེམས་ཅན་ཐམས་ཅད་གནས་མང་རྒྱས་འགེངས་འགྱུར།
en: “You will pervade the many locations of all beings.

source: །ཞིང་རྣམས་ཀུན་གྱི་གནས་སུ་འགྲོ་བར་འགྱུར།
en: You will go to the locations of all realms.

source: །སངས་རྒྱས་ཀུན་གྱི་གནས་སུ་ཕྱིན་པར་འགྱུར།
en: You will go to the locations of all buddhas.

source: །ཁྱོད་ནི་དེ་འདྲའི་ཕྱོགས་སུ་ཞུགས་པ་ཡིན།
en: You will be present in such directions as these.

source: །ཁྱོད་ནི་ཏིང་འཛིན་གནས་སུ་འཇུག་པར་འགྱུར།
en: “You will enter the dwelling of samādhis,

source: །ཁྱོད་ཀྱིས་རྣམ་ཐར་གནས་རྣམས་ཐོབ་པར་འགྱུར།
en: You will attain the dwelling of liberations,

source: །ཁྱོད་ནི་མངོན་ཤེས་གནས་ལ་སྤྱོད་པར་འགྱུར།
en: You will be active in the dwelling of higher cognitions,

source: །ཆོས་ཀྱི་དབྱིངས་ཀྱི་གནས་ལ་རབ་ཏུ་གནས།
en: And you will be established in the dwelling of the realm of the Dharma.

source: །ཉི་ཟླའི་གཟུགས་རྣམས་རབ་ཏུ་སྣང་བ་ལྟར།
en: “You will shine like the sun and the moon.

source: །སེམས་ཅན་ཀུན་གྱི་གནས་སུ་འཆར་བར་འགྱུར།
en: You will appear within the dwellings of all beings.

source: །རྒྱལ་བ་རྣམས་ཀྱི་སྤྱན་སྔར་མངོན་འབྱུང་འགྱུར།
en: You will ascend to be before the jinas.

source: །ཁྱོད་ཀྱི་འབྱུང་བའི་ལམ་ཆེན་དེ་འདྲའོ།
en: You will ascend to great paths such as these.
